package solver.integrals.samples

object Samples {
  val integrals = List(
    "∫(-x³ - x² - 2x + 1) dx",
    "∫ (-3x³ - 5x² + 4x - 2) dx",
    "∫ (-x³ - x² + x + 3) dx",
    "∫ (-2x³ - 4x² + 8x - 4) dx",
    "∫ (-2x³ - 3x² + x + 5) dx",
    "∫ (3x³ + 5x² + 3x - 6) dx",
    "∫ (4x³ - 5x² + 6x - 7) dx",
    "∫ (3x³ - 2x² - 7x - 8) dx",
    "∫ (2x³ - 3x² + 5x - 9) dx",
    "∫ (x³ - 3x² + 7x - 10) dx",
    "∫ (2x³ - 9x² - 7x + 11) dx",
    "∫ (x³ + 2x² - 3x - 12) dx",
    "∫ (-2x³ - 5x² + 7x - 13) dx",
    "∫ (2x³ - 2x² + 7x - 14) dx",
    "∫ (5x³ - 2x² + 3x - 15) dx",
    "∫ (3x³ - 4x² + 5x - 16) dx",
    "∫ (3x³ - 4x² + 7x - 17) dx",
    "∫ (x³ - 5x² + 3x - 16) dx",
    "∫ (x³ - 3x² + 6x - 19) dx",
    "∫ (4x³ - 3x² + 5x - 20) dx",
    "∫ (2x³ - 5x² - 3x + 21) dx",
    "∫ (2x³ - 3x² + 4x - 22) dx",
    "∫ (-x³ - 2x² + 3x + 23) dx",
    "∫ (x³ - 2x² - 5x + 24) dx",
    "∫ (2x³ - 4x² + 6x - 25) dx",
    "∫ (3x³ - 2x² + 7x + 26) dx",
    "∫ (2x³ - 5x² - 3x + 21) dx", 
    "∫ 1 / x dx",                 
    "∫ 1 / √(x) dx",              
    "∫ 1 / x² dx"    
  )
  
  val integralsMethods = List(
    "Метод Симпсона",
    "Метод трапеции",
    "Метод Монте Карло",
    "Метод левых прямоугольников",
    "Метод средних треугольников",
    "Метод правых треугольников",
    "Метод Гаусса"
  )
}